# StairsWinderGenLayoutFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsWinderGenLayoutFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Fail to generate run layout and then cannot make winder run
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsWinderGenLayoutFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderGenLayoutFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsWinderGenLayoutFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace